Proyecto-02/Code/benchmarks/single_topology.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: tests/throughput_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 1 looping VUs for 30s (gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

running (0m04.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [   3% ] 1 VUs  01.0s/30s

running (0m05.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
default   [   7% ] 1 VUs  02.0s/30s

running (0m06.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  03.0s/30s

running (0m07.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
default   [  13% ] 1 VUs  04.0s/30s

running (0m08.0s), 1/1 VUs, 32 complete and 0 interrupted iterations
default   [  17% ] 1 VUs  05.0s/30s

running (0m09.0s), 1/1 VUs, 39 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  06.0s/30s

running (0m10.0s), 1/1 VUs, 45 complete and 0 interrupted iterations
default   [  23% ] 1 VUs  07.0s/30s

running (0m11.0s), 1/1 VUs, 52 complete and 0 interrupted iterations
default   [  27% ] 1 VUs  08.0s/30s

running (0m12.0s), 1/1 VUs, 59 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  09.0s/30s

running (0m13.0s), 1/1 VUs, 66 complete and 0 interrupted iterations
default   [  33% ] 1 VUs  10.0s/30s

running (0m14.0s), 1/1 VUs, 73 complete and 0 interrupted iterations
default   [  37% ] 1 VUs  11.0s/30s

running (0m15.0s), 1/1 VUs, 80 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  12.0s/30s

running (0m16.0s), 1/1 VUs, 85 complete and 0 interrupted iterations
default   [  43% ] 1 VUs  13.0s/30s

running (0m17.0s), 1/1 VUs, 92 complete and 0 interrupted iterations
default   [  47% ] 1 VUs  14.0s/30s

running (0m18.0s), 1/1 VUs, 99 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  15.0s/30s

running (0m19.0s), 1/1 VUs, 105 complete and 0 interrupted iterations
default   [  53% ] 1 VUs  16.0s/30s

running (0m20.0s), 1/1 VUs, 112 complete and 0 interrupted iterations
default   [  57% ] 1 VUs  17.0s/30s

running (0m21.0s), 1/1 VUs, 119 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  18.0s/30s

running (0m22.0s), 1/1 VUs, 126 complete and 0 interrupted iterations
default   [  63% ] 1 VUs  19.0s/30s

running (0m23.0s), 1/1 VUs, 133 complete and 0 interrupted iterations
default   [  67% ] 1 VUs  20.0s/30s

running (0m24.0s), 1/1 VUs, 139 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  21.0s/30s

running (0m25.0s), 1/1 VUs, 146 complete and 0 interrupted iterations
default   [  73% ] 1 VUs  22.0s/30s

running (0m26.0s), 1/1 VUs, 153 complete and 0 interrupted iterations
default   [  77% ] 1 VUs  23.0s/30s

running (0m27.0s), 1/1 VUs, 160 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  24.0s/30s

running (0m28.0s), 1/1 VUs, 167 complete and 0 interrupted iterations
default   [  83% ] 1 VUs  25.0s/30s

running (0m29.0s), 1/1 VUs, 173 complete and 0 interrupted iterations
default   [  87% ] 1 VUs  26.0s/30s

running (0m30.0s), 1/1 VUs, 180 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  27.0s/30s

running (0m31.0s), 1/1 VUs, 187 complete and 0 interrupted iterations
default   [  93% ] 1 VUs  28.0s/30s

running (0m32.0s), 1/1 VUs, 194 complete and 0 interrupted iterations
default   [  97% ] 1 VUs  29.0s/30s

running (0m33.0s), 1/1 VUs, 199 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  30.0s/30s


  █ THRESHOLDS 

    batch_latency_ms
    ✓ 'p(95)<1000' p(95)=58

    events_processed
    ✓ 'count>5000' count=20100


  █ TOTAL RESULTS 

    checks_total.......: 201     6.041893/s
    checks_succeeded...: 100.00% 201 out of 201
    checks_failed......: 0.00%   0 out of 201

    ✓ ingest successful

    CUSTOM
    batch_latency_ms...............: avg=46.079602 min=17       med=43       max=283      p(90)=48       p(95)=58      
    events_processed...............: 20100  604.189279/s

    HTTP
    http_req_duration..............: avg=43.15ms   min=14.95ms  med=40.19ms  max=279.9ms  p(90)=44.61ms  p(95)=53.78ms 
      { expected_response:true }...: avg=43.15ms   min=14.95ms  med=40.19ms  max=279.9ms  p(90)=44.61ms  p(95)=53.78ms 
    http_req_failed................: 0.00%  0 out of 204
    http_reqs......................: 204    6.13207/s

    EXECUTION
    iteration_duration.............: avg=149.83ms  min=119.32ms med=146.38ms max=387.24ms p(90)=153.06ms p(95)=162.01ms
    iterations.....................: 201    6.041893/s
    vus............................: 1      min=0        max=1
    vus_max........................: 1      min=1        max=1

    NETWORK
    data_received..................: 584 kB 18 kB/s
    data_sent......................: 3.2 MB 97 kB/s



running (0m33.3s), 0/1 VUs, 201 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  30s